---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.#ctor
source: html/ec339582-61c5-6f07-4acd-93982504f8fb.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.#ctor Method

Constructs a new empty extrusion data object.

## Syntax (C#)
```csharp
public IFCExtrusionData()
```